---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksColor
source: html/d917783f-dbfd-3ba0-6d53-2dcd0ee07acc.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksColor Property

The property labeled "Color" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintFlecksColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.